[

   {
  "title": "Guru Food’s Chilli Pickle Recipe",
  "date": "Jun 15, 2025",
  "slug": "guru-foods-chilli-pickle-recipe",
  "category": "Recipes",
  "desc": "Bring the authentic taste of Guru Food’s Chilli Pickle into your kitchen with this traditional recipe using fresh green chilies and a blend of aromatic Indian spices. Tangy, spicy, and full of flavor, it’s a perfect accompaniment for any meal.",
  "image": "no1.jpg",
  "link": "#",
  "content": "## Guru Food’s Chilli Pickle Recipe\n\nBring the authentic taste of Guru Food’s Chilli Pickle into your kitchen with this traditional recipe. This pickle is bursting with tangy, spicy flavors made from fresh green chillies and age-old spices, perfect as a condiment to elevate any meal.\n\n---\n\n### Ingredients\n\n- **250 grams fresh green chillies** (medium-sized, slit lengthwise)\n- **2 tablespoons mustard seeds**\n- **1 tablespoon fennel seeds**\n- **1 tablespoon fenugreek seeds**\n- **1 teaspoon turmeric powder**\n- **2 teaspoons red chili powder** (adjust to taste)\n- **Salt to taste** (approx. 2 teaspoons)\n- **1/4 cup mustard oil** (or any vegetable oil)\n- **2 tablespoons lemon juice** (optional, for extra tanginess)\n- **1 tablespoon asafoetida (hing)**\n\n---\n\n### Instructions\n\n1. **Prepare the spices:** Dry roast the mustard seeds, fennel seeds, and fenugreek seeds over medium heat until fragrant (about 2 minutes). Let them cool, then coarsely grind using a mortar and pestle or spice grinder.\n2. **Prepare the chillies:** Wash and thoroughly dry the green chillies. Make sure they are fully dry to avoid spoilage.\n3. **Mix spices and chillies:** In a large bowl, combine the slit green chillies with turmeric, chili powder, salt, asafoetida, and the ground spice mix. Toss well to coat.\n4. **Heat the oil:** Heat mustard oil until it starts to smoke, then allow it to cool slightly. This reduces pungency and makes it safer for consumption.\n5. **Combine oil and chillies:** Pour the cooled mustard oil over the chillies. Add lemon juice if using, and mix thoroughly.\n6. **Jar the pickle:** Transfer the mixture into a clean, dry glass jar. Press gently to remove air pockets, without mashing the chillies.\n7. **Maturation:** Seal and place the jar in a warm, sunny spot for 7–10 days. Shake gently once daily to help the flavors meld.\n8. **Storage:** After maturation, store in the refrigerator. The pickle is ready to use and stays fresh for several months.\n\n> **Note:** Always use dry utensils when handling the pickle to avoid contamination. Adjust spices and salt as per personal taste.\n\n---\n\n### Serving Suggestions\n\nEnjoy Guru Food’s Chilli Pickle as a:\n- Tangy and spicy side with Indian breads (roti, paratha, naan)\n- Zesty accompaniment to rice dishes and curries\n- Condiment for grilled meats or roasted vegetables\n- Spicy spread on sandwiches and wraps\n\n---\n\n### Final Tip\n\nThis traditional chilli pickle not only adds a burst of flavor to your meals but also carries the heritage of Indian kitchen wisdom. Try it out and share the joy of homemade goodness!"
},
  {
  "title": "Guru Food Murabba Recipe",
  "date": "Jun 18, 2025",
  "slug": "guru-food-murabba-recipe",
  "category": "Recipes",
  "desc": "Learn to make traditional Indian murabba using fresh fruits and aromatic spices. This sweet preserve is perfect as a snack or accompaniment to meals.",
  "image": "applemurabba.jpg",
  "link": "#",
  "content": "## Guru Food Murabba Recipe\n\nMurabba is a traditional Indian fruit preserve that is not only delicious but also packed with health benefits. This recipe will guide you through making a simple and flavorful Murabba using your favorite fruits.\n\n---\n\n### Ingredients\n\n- **500 grams of your choice of fruit** (e.g., mango, apple, or guava)\n- **300 grams sugar** (adjust based on the sweetness of the fruit)\n- **1 cup water**\n- **1 teaspoon cardamom powder**\n- **1 tablespoon lemon juice**\n- **1/2 teaspoon saffron strands** (optional, for flavor and color)\n- **1 tablespoon chopped nuts** (optional, for garnish)\n\n---\n\n### Instructions\n\n1. **Prepare the fruit:** Wash and peel (if needed) the fruit. Cut it into small cubes or slices as desired.\n2. **Cook the fruit:** Add the fruit and water to a heavy-bottomed pan. Cook over medium heat for 10–15 minutes until softened.\n3. **Add sugar:** Stir in the sugar and cook until fully dissolved.\n4. **Simmer the mixture:** Lower the heat and simmer the mixture for 20–30 minutes, stirring occasionally, until it thickens to a syrupy consistency.\n5. **Add flavorings:** Add cardamom powder, lemon juice, and saffron strands (if using). Cook for another 5 minutes.\n6. **Cool and jar:** Remove from heat, let it cool, and transfer to a clean, dry glass jar. Seal tightly.\n\n> **Tip:** Always use clean utensils to extend shelf life. Refrigerated murabba can last for several months.\n\n---\n\n### Serving Suggestions\n\n- Enjoy it with **parathas** or **chapatis** as a sweet side.\n- Use as a **topping for desserts** like yogurt or ice cream.\n- Serve a spoonful as a **digestive treat** after meals.\n\n---\n\n### Why You’ll Love It\n\nMurabba is a tasty way to enjoy fruits year-round, with added benefits from spices like cardamom and saffron. It combines the goodness of nature with traditional Indian preserving methods — a true comfort food staple!"
}
,
   {
  "title": "Guru Food Rose Sharbat Recipe",
  "date": "Jun 20, 2025",
  "slug": "guru-food-rose-sharbat-recipe",
  "category": "Recipes",
  "desc": "Cool down with this refreshing and fragrant Rose Sharbat made from real rose petals. A perfect summer drink with traditional roots and natural ingredients.",
  "image": "no3.jpg",
  "link": "#",
  "content": "## Guru Food Rose Sharbat Recipe\n\nRose Sharbat is a fragrant and refreshing drink made from natural rose petals. This delightful beverage is perfect for hot summer days and is known for its natural cooling properties.\n\n---\n\n### Ingredients\n\n- **1 cup fresh rose petals** (organic, pesticide-free preferred)\n- **2 cups water**\n- **1 cup sugar** (adjust to taste)\n- **1 tablespoon lemon juice** (optional, for tanginess)\n- **Ice cubes** (for serving)\n- **Mint leaves** (optional, for garnish)\n\n---\n\n### Instructions\n\n1. **Prepare the petals:** Rinse the rose petals gently under running water. Pat them dry.\n2. **Infuse the petals:** In a saucepan, boil 2 cups of water. Add the rose petals and simmer for 10–15 minutes until the water takes on a rosy hue and aroma.\n3. **Strain:** Cool slightly, then strain the liquid using a fine sieve or muslin cloth.\n4. **Add sugar:** While still warm, stir in the sugar until it dissolves completely. Adjust for sweetness.\n5. **Add lemon juice:** Stir in lemon juice if desired. It enhances the flavor with a refreshing tang.\n6. **Cool and store:** Let the sharbat cool fully, then bottle and refrigerate. It keeps well for up to a week.\n7. **Serve:** Mix 2–3 tablespoons of the concentrate with a glass of cold water or soda. Add ice cubes and mint leaves for garnish.\n\n---\n\n### Notes\n\n- **No fresh petals?** You can substitute dried rose petals (about ¼ cup), but fresh petals offer superior flavor and aroma.\n- **Customize:** Feel free to tweak the sugar, water, or lemon content based on your taste preference and use case (concentrate vs. ready-to-drink).\n\n---\n\n### Serving Suggestions\n\n- Serve chilled during hot summer afternoons.\n- Use as a welcome drink for guests.\n- Pair with light snacks or Indian sweets.\n\n---\n\n### Why You'll Love It\n\nThis homemade sharbat is easy to prepare, naturally aromatic, and free from artificial colors or flavors. It’s the perfect traditional beverage to enjoy with a modern twist!"
}

 
]